//
//  File.swift
//  
//
//  Created by Nickolay Truhin on 06.04.2021.
//

import Foundation

let RU_WEEKDAY_OFFSET = [
    "воскресенье": 0,
    "вс": 0,
    "понедельник": 1,
    "пн": 1,
    "вторник": 2,
    "вт":2,
    "среда": 3,
    "ср": 3,
    "четверг": 4,
    "чт": 4,
    "пятница": 5,
    "пт": 5,
    "суббота": 6,
    "сб": 6
]

let RU_WEEKDAY_OFFSET_PATTERN = "(?:" + RU_WEEKDAY_OFFSET.keys.joined(separator: "|") + ")"

let RU_MONTH_OFFSET = [
    "января": 1,
    "янв": 1,
    "янв.": 1,
    "февраля": 2,
    "фев": 2,
    "фев.": 2,
    "марта": 3,
    "мар": 3,
    "мар.": 3,
    "апреля": 4,
    "апр": 4,
    "апр.": 4,
    "мая": 5,
    "июня": 6,
    "июн": 6,
    "июн.": 6,
    "июля": 7,
    "июл": 7,
    "июл.": 7,
    "августа": 8,
    "авг": 8,
    "авг.": 8,
    "сентября": 9,
    "сен": 9,
    "сен.": 9,
    "октября": 10,
    "окт": 10,
    "окт.": 10,
    "ноября": 11,
    "ноя": 11,
    "ноя.": 11,
    "декября": 12,
    "дек": 12,
    "дек.": 12
]

let RU_MONTH_PATTERN = "(?:"
    + RU_MONTH_OFFSET.keys.joined(separator: "|").replacingOccurrences(of: ".", with: "\\.")
    + ")";

let RU_INTEGER_WORDS = [
    "один": 1,
    "два": 2,
    "три": 3,
    "четыре": 4,
    "пять": 5,
    "шесть": 6,
    "семь": 7,
    "восемь": 8,
    "девять": 9,
    "десять": 10,
    "одиннадцать": 11,
    "двенадцать": 12
]
let RU_INTEGER_WORDS_PATTERN = "(?:" + RU_INTEGER_WORDS.keys.joined(separator: "|") + ")"

let RU_ORDINAL_WORDS = [
    "перв(?:ое|ый|го)": 1,
    "втор(?:ое|й|ого)": 2,
    "трет(?:ье|ий|ьего)": 3,
    "четверт(?:ое|ый|ого)": 4,
    "пят(?:ое|ый|ого)": 5,
    "шест(?:ое|ой|ого)": 6,
    "седьм(?:ое|ой|ого)": 7,
    "восьм(?:ое|ой|ого)": 8,
    "девят(?:ое|ый|ого)": 9,
    "десят(?:ое|ый|ого)": 10,
    "одинадцат(?:ое|ый|ого)": 11,
    "двенадцат(?:ое|ый|ого)": 12,
    "тринадцат(?:ое|ый|ого)": 13,
    "четырнадцат(?:ое|ый|ого)": 14,
    "пятнадцат(?:ое|ый|ого)": 15,
    "шеснадцат(?:ое|ый|ого)": 16,
    "семнадцат(?:ое|ый|ого)": 17,
    "восемнадцат(?:ое|ый|ого)": 18,
    "девятнадцат(?:ое|ый|ого)": 19,
    "двадцат(?:ое|ый|ого)": 20,
    "двадцать перв(?:ое|ый|го)": 21,
    "двадцать втор(?:ое|й|ого)": 22,
    "двадцать трет(?:ье|ий|ьего)": 23,
    "двадцать четверт(?:ое|ый|ого)": 24,
    "двадцать пят(?:ое|ый|ого)": 25,
    "двадцать шест(?:ое|ой|ого)": 26,
    "двадцать седьм(?:ое|ой|ого)": 27,
    "двадцать восьм(?:ое|ой|ого)": 28,
    "двадцать девят(?:ое|ый|ого)": 29,
    "тридцат(?:ое|ый|ого)": 30,
    "тридцвть перв(?:ое|ый|ого)": 31
]
let RU_ORDINAL_WORDS_PATTERN = "(?:\(RU_ORDINAL_WORDS.keys.joined(separator: "|").replacingOccurrences(of: " ", with: "[ -]")))"

let TIME_UNIT =
    "(" + RU_INTEGER_WORDS_PATTERN + "|[0-9]+|[0-9]+\\.[0-9]+|an?(?:\\s*несколько)?|пол(?:\\s*an?)?)\\s*" +
    "(секунды?|минуты?|часа?|часов?|недель?|недели|дней?|дня?|месяцев?|месяца?|лет?|года?)\\s*";

let TIME_UNIT_STRICT =
    "(?:[0-9]+|an?)\\s*" +
    "(?:секунд?|минут?|часов?|дней?)\\s*";

let RU_TIME_UNIT_PATTERN = "(?:" + TIME_UNIT + ")+";
let RU_TIME_UNIT_STRICT_PATTERN = "(?:" + TIME_UNIT_STRICT + ")+";
