//
//  File.swift
//  
//
//  Created by Nickolay Truhin on 06.04.2021.
//

import Foundation

let RU_WEEKDAY_OFFSET = [
    "воскресенье": 0,
    "вс": 0,
    "понедельник": 1,
    "пн": 1,
    "вторник": 2,
    "вт":2,
    "среда": 3,
    "ср": 3,
    "четверг": 4,
    "чт": 4,
    "пятница": 5,
    "пт": 5,
    "суббота": 6,
    "сб": 6
]

let RU_WEEKDAY_OFFSET_PATTERN = "(?:" + RU_WEEKDAY_OFFSET.keys.joined(separator: "|") + ")"

let RU_MONTH_OFFSET = [
    "января": 1,
    "янв": 1,
    "янв.": 1,
    "февраля": 2,
    "фев": 2,
    "фев.": 2,
    "марта": 3,
    "мар": 3,
    "мар.": 3,
    "апреля": 4,
    "апр": 4,
    "апр.": 4,
    "мая": 5,
    "июня": 6,
    "июн": 6,
    "июн.": 6,
    "июля": 7,
    "июл": 7,
    "июл.": 7,
    "августа": 8,
    "авг": 8,
    "авг.": 8,
    "сентября": 9,
    "сен": 9,
    "сен.": 9,
    "октября": 10,
    "окт": 10,
    "окт.": 10,
    "ноября": 11,
    "ноя": 11,
    "ноя.": 11,
    "декября": 12,
    "дек": 12,
    "дек.": 12
]

let RU_MONTH_PATTERN = "(?:"
    + RU_MONTH_OFFSET.keys.joined(separator: "|").replacingOccurrences(of: ".", with: "\\.")
    + ")";

let RU_INTEGER_WORDS = [
    "один": 1,
    "два": 2,
    "три": 3,
    "четыре": 4,
    "пять": 5,
    "шесть": 6,
    "семь": 7,
    "восемь": 8,
    "девять": 9,
    "десять": 10,
    "одиннадцать": 11,
    "двенадцать": 12
]
let RU_INTEGER_WORDS_PATTERN = "(?:" + RU_INTEGER_WORDS.keys.joined(separator: "|") + ")"

let RU_ORDINAL_WORDS = [
    "первое": 1,
    "второе": 2,
    "третье": 3,
    "четвертое": 4,
    "пятое": 5,
    "шестое": 6,
    "седьмое": 7,
    "восьмое": 8,
    "девятое": 9,
    "десятое": 10,
    "одинадцатое": 11,
    "двенадцатое": 12,
    "тринадцатое": 13,
    "четырнадцатое": 14,
    "пятнадцатое": 15,
    "шеснадцатый": 16,
    "семнадцатый": 17,
    "восемнадцатый": 18,
    "девятнадцатый": 19,
    "двадцатый": 20,
    "двадцать first": 21,
    "двадцать second": 22,
    "двадцать third": 23,
    "двадцать fourth": 24,
    "двадцать fifth": 25,
    "двадцать sixth": 26,
    "двадцать seventh": 27,
    "двадцать eighth": 28,
    "двадцать ninth": 29,
    "тридцатый": 30,
    "тридцвть первое": 31
]
let RU_ORDINAL_WORDS_PATTERN = "(?:\(RU_ORDINAL_WORDS.keys.joined(separator: "|").replacingOccurrences(of: " ", with: "[ -]")))"

let TIME_UNIT =
    "(" + RU_INTEGER_WORDS_PATTERN + "|[0-9]+|[0-9]+\\.[0-9]+|an?(?:\\s*несколько)?|пол(?:\\s*an?)?)\\s*" +
    "(секунды?|минуты?|часа?|часов?|недель?|недели|дней?|дня?|месяцев?|месяца?|лет?|года?)\\s*";

let TIME_UNIT_STRICT =
    "(?:[0-9]+|an?)\\s*" +
    "(?:секунд?|минут?|часов?|дней?)\\s*";

let RU_TIME_UNIT_PATTERN = "(?:" + TIME_UNIT + ")+";
let RU_TIME_UNIT_STRICT_PATTERN = "(?:" + TIME_UNIT_STRICT + ")+";
